Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: A piece of code that’s linked to an event that can occur in your app.
ja: 一片のコード、それは、あなたのアプリで起こるイベントと連結されます。

source: A piece of code written specifically to test a small, self-contained piece of behavior in your app to make sure it behaves correctly.
ja: あなたのアプリにおける小さな、自己充足の断片の挙動をテストして、それが正しく振舞うことを確かめるために特に書かれたコード断片。

source: A piece of data encapsulated within a class, structure, or enumeration.
ja: クラス、構造体、または列挙の内部にカプセル化される一片のデータ。

source: A piece of text in a source code file that doesn’t get compiled as part of the program but provides context or other useful information about individual pieces of code.
ja: ソースコードファイル中のあるテキスト断片、それはプログラムの一部としてコンパイルされませんが、前後関係や別の有益な情報をコードの個々の部分について提供します。

source: A property list is a structured text file that contains essential configuration information about your app.
ja: プロパティリストは、構造化されたテキストファイルで、あなたのアプリについての本質的設定情報を含みます。

source: A reference to an object in a storyboard from a source code file.
ja: ストーリーボードの中のオブジェクトへのソースコードファイルからの参照。

source: A representation of a wildcard in Swift (_).
ja: Swiftにおけるひとつのワイルドカードの表現（_）。

source: A reusable, named piece of code that can be referred to from many places in a program.
ja: 再利用可能な、名前をつけられたコード片、それはプログラムの多くの場所から参照されることができます。

source: A reusable, named piece of code that’s associated with a particular class, structure, or enumeration.
ja: 再利用できる、名前をつけられたコード断片、それは、特定のクラス、構造体、または列挙と結び付けられます。

source: A secondary initializer, which adds additional behavior or customization, but must eventually call through to a designated initializer.
ja: 二次的なイニシャライザ、それは追加の挙動または注文を加えます、しかし最後には指定イニシャライザを呼び出すことに至らなくてはなりません。

source: A selector is an opaque value that identifies the method.
ja: セレクタは、メソッドを識別する不透明な値です。

source: A self-contained block of functionality that can be passed around and used in your code.
ja: 機能性の自己充足のブロック、それはあなたのコードの中であちこちに渡され使われることができます。

source: A set of functions, classes, protocols, and other components that define how pieces of software should interact with each other.
ja: ひとそろいの関数、クラス、プロトコル、および他のコンポーネント、それは、どのようにソフトウェアの断片が互いに相互作用するべきかを定義します。

source: A set of data types and capabilities designed for Swift and baked into the language.
ja: Swiftのために設計され、言語の中へ練り込まれる一揃いのデータ型と能力。

source: A shortcut menu titled Action Segue appears in the location where the drag ended.
ja: Action Segueとタイトルがついたショートカットメニューが、このドラッグが終わったところに現れます。

source: A shortcut menu titled Selection Segue appears in the location where the drag ended.
ja: Selection Segue（セグエを選択）とタイトルを付けられるショートカットメニューが、ドラッグが終わったところに現れます。

source: A software application that provides a set of tools for software development.
ja: あるソフトウェアアプリケーション、それは、ソフトウェア開発のためのひとそろいのツールを提供します。

source: A specialized view controller subclass that manages transitions backward and forward through a series of view controllers.
ja: 特殊化されたビューコントローラサブクラス、それは一続きのビューコントローラの中での前後の場面転換を管理します。

source: A specialized type of view (specifically, an instance of the UIControl class or one of its subclasses) that responds to user input.
ja: ビューのある特殊化した型（具体的には、UIControlクラスのインスタンスまたはそれのサブクラスの１つ）、それはユーザ入力に応答します。

source: A specific occurrence of a class (that is, an object), structure, or enumeration.
ja: あるクラス（すなわち、あるオブジェクト）、構造体、または列挙に属するある特定の存在。

source: A stack view provides a streamlined interface for laying out a collection of views in either a column or a row.
ja: スタックビューは、いくらかのビューからなる１集団を縦列か横列のどちらかでレイアウトするための簡素化したインターフェイスを提供します。

source: A suggested fix for a compiler error in Xcode.
ja: Xcodeにおいてコンパイラエラーに対して提案される修正。

source: A superview maintains a strong reference to all of its subviews.
ja: スーパービューは、すべてのそれのサブビューに対する強い参照を維持します。

source: A table view data source, as implied by its name, supplies the table view with the data it needs to display.
ja: あるテーブルビューデータソースは、それの名前によってほのめかされるように、そのテーブルビューをそれが表示する必要があるデータとともに提供します。

source: A table view delegate helps the table view manage cell selection, row heights, and other aspects related to displaying the data.
ja: あるテーブルビュー委任先は、テーブルビューがセル選択、行の高さ、そして他のデータ表示に関する面を管理するのを助けます。

source: A table view is managed by a table view controller (UITableViewController).
ja: テーブルビューは、テーブルビューコントローラ（UITableViewController）によって管理されます。

source: A test method fails if one or more of its tests fail.
ja: あるテストメソッドは、それのテストのひとつ以上が失敗するならば失敗します。

source: A text field lets a user type in a single line of text, which you’ll use as the name of a meal.
ja: テキスト欄は、ユーザにただ１行だけのテキスト、あなたが食事の名前として使うもの、を入力させます。

source: A text field’s delegate communicates with the text field while the user is editing the text, and knows when important events occur—such as when a user starts or stops editing text.
ja: テキスト欄の持つ委任先は、ユーザがテキストを編集している間テキスト欄と通信します、それで重要なイベントが起こる時がわかります — 例えばユーザがテキスト編集を始めるまたは止める時など。

source: A tool for debugging and for logging information for debugging purposes.
ja: デバッグするための、そしてデバッグ目的の情報のログを取るためのツール（道具）。

source: A tool to manage assets like images that are used by your app as part of its user interface (UI).
ja: あなたのアプリによってユーザインターフェイス（UI）の一部として使われる画像のような資産（アセット）を管理するためのツール。

source: A transition from one scene to another in a storyboard.
ja: １つのシーンから別のものへのストーリボードにおける転換。

source: A type of segue used to implement backward navigation.
ja: 後方ナビゲーションを実装するために使われるセグエの１つの型。

source: A type of file in which you can change and play around with Swift code directly in Xcode and see the immediate results.
ja: ある種のファイル、そこにおいてあなたはSwiftコードを変更したり遊んだりが直接にXcodeにおいてできます、そして直に結果を見ることができます。

source: A user can add, remove, or edit a meal.
ja: ユーザ（利用者）は、あるときの食事の追加、削除、および編集が行えます。

source: A user might decide not to keep edits to a meal, and want to return to the meal list without saving any changes.
ja: ユーザは、ある食事に対する変更を残すことを止めようと決心するかもしれません、そして何ら変更を保存せずに食事リストに戻りたいかもしれません。

source: A user might decide to cancel the addition of a new meal, and return to the meal list without saving anything.
ja: ユーザは、新しい食事の追加をキャンセルして、何も保存しないで食事リストに戻ることに決めるかもしれません。

source: A value that can be both viewed (read) and changed (written).
ja: ある値、それは、眺められること（読み出し）と変更されること（書き込み）の両方が可能です。

source: A value that can change after it’s been initialized, indicated in Swift by the var keyword.
ja: ある値、それは、それが初期化された後で変更が可能です、Swiftではvarキーワードで示されます。

source: A value that can only be viewed (read) but never changed (written).
ja: ある値、それは、眺められること（読み出し）ができますが、決して変更されること（書き込み）ができません。

source: A value that cannot be changed (or mutated) after it’s initialized, like a constant.
ja: ある値、それは、それが初期化された後、定数のように、変更される（または変化する）ことができないものです。

source: A value that contains either an underlying value or nil to indicate that the value is missing.
ja: ある値、それは、ある裏に潜んだ値またはその値が見つからないことを示すnilを含みます

source: A value that is able to be changed (or mutated) after it’s initialized, like a variable.
ja: ある値、それは変更される（または変化させられる）ことが、それが初期化される後で可能です、変数のように。

source: A value that’s initialized once and cannot change, indicated in Swift by the let keyword.
ja: ある値、それは一度だけ初期化されます、そして変更されることが出来ず、Swiftにおいてletキーワードによって示されます。

source: A value you pass in to a function, method, or initializer to satisfy one of its parameters.
ja: あなたが関数、メソッド、またはイニシャライザに渡して、それのパラメータの１つを満たすもの。

source: A view can have multiple subviews and only one superview.
ja: あるビューは、複数のサブビューと１つだけのスーパービューを持つことができます。

source: A view controller manages a single content view with its hierarchy of subviews.
ja: あるビューコントローラは、１つだけのコンテンツビューをそれのサブビュー階層とともに管理します。

source: A view displays content, whereas a control is used to modify the content in some way.
ja: ビューはコンテンツを表示します、それに対してコントロールはコンテンツをある方法で修正するために使われます。

source: A view is a rectangular region that can draw its own content and respond to user events.
ja: ビューは、ある長方形の領域です、それはそれ独自のコンテンツを描画してユーザイベントに応答することができます。

source: A view’s intrinsic content size is the preferred size for the view based on its content.
ja: あるビューの持つ固有コンテンツサイズは、ビューのためのそれのコンテンツに基づいた好ましい大きさです。

source: A way to check the type of an object, and to treat that object as if it’s a different superclass or subclass from somewhere else in its own class hierarchy.
ja: あるオブジェクトの型を確認するための、そしてそのオブジェクトがまるでそれ自身のクラス階層の中のどこか他の別のスーパークラスまたはサブクラスであるかのように扱うための方法です。

source: About the Lessons
ja: このレッスンについて

source: Above your table view you should now see extra space.
ja: あなたのテーブルビューの上部で、あなたは今では余分な空間を見るはずです。

source: Above “Spacing to nearest neighbor,” click the right horizontal constraint to select it.
ja: 上の「Spacing to nearest neighbor」で、右横制約をクリックしてそれを選択します。

source: Above “Spacing to nearest neighbor,” click the two horizontal constraints and the top vertical constraint to select them.
ja: 上の方の「Spacing to nearest neighbor（すぐ隣との間隔）」で、２つの水平制約と上部の垂直制約をクリックして、それらを選択してください。

source: Add @IBDesignable to the beginning of the line as shown:
ja: @IBDesignableを行の始まりに次に示すように加えてください：

source: Add Accessibility Information
ja: アクセシビリティ情報を加える

source: Add Buttons to the View
ja: ボタンをビューに加える

source: Add Images to Your Project
ja: あなたのプロジェクトに画像を加える

source: Add Star Images to the Buttons
ja: 星の画像をボタンに加える

source: Add Support for Interface Builder
ja: Interface Builderに対するサポートを加える

source: Add a Meal Photo
ja: 食事の写真を加える

source: Add a Segue to Navigate Forward
ja: セグエを加えて前へナビゲートする

source: Add a call to updateSaveButtonState() in the implementation to make sure the Save button is disabled until a user enters a valid name:
ja: updateSaveButtonState()への呼び出しを実装において加えて、ユーザが有効な名前を入力するまでSaveボタンが使用不能にされるのを確実にしてください：

source: Add a constraint to fix that.
ja: ある制約を加えてそれを修正してください。

source: Add a placeholder image to let users know that they can interact with the image view to select a photo.
ja: プレースホルダ画像を加えることで、ユーザに彼らがイメージビューと相互作用してある写真を選択できることをわかるようにしてください。

source: Add a property observer to the rating property, and have it call the updateButtonSelectionStates() method whenever the rating changes.
ja: あるプロパティオブザーバをratingプロパティに加えてください、そしてそれがupdateButtonSelectionStates()メソッドを格付けが変化するときはいつでも呼ぶようにしてください。

source: Add a second else statement immediately below the first:
ja: ２番目のelse文を最初の直下に加えるには：

source: Add accessibility information to a custom control
ja: アクセシビリティ情報をカスタムコントロールに加える

source: Add code at the beginning of the method, before the rest of the template implementation:
ja: このメソッドの冒頭、残りのひな形実装の前にコードを加えてください：

source: Add tests to the test case that use both no rating and the highest positive rating.
ja: 幾つかのテストをこのテスト項目に加えます、それは格付けなしと最も高い可能な格付けの両方を使います。

source: Add the @IBInspectable attribute to the desired properties.
ja: @IBInspectable属性を望むプロパティに加えてください。

source: Add the AddItem case to the switch.
ja: AddItemケース節をswichに加えてください。

source: Add the ShowDetail case to the switch.
ja: ShowDetailケース節をswitchに加えてください。

source: Add the default case.
ja: 省略時の場合を加えてください。

source: Add the following if statement:
ja: if文に続けて以下を加えてください：

source: Add the following code at the end of the implementation:
ja: 以下のコードをこの実装の終わりに加えてください：

source: Add the following code between the negative rating and the empty string tests:
ja: 以下のコードを負の格付けと空の文字列のテストの間に加えてください。

source: Add the following code inside the initializer:
ja: 以下のコードをイニシャライザ内部に加えてください。

source: Add the following code just above the code that initializes the stored properties.
ja: 以下のコードを、保存プロパティを初期化するコードのすぐ上に加えてください。

source: Add the following code:
ja: 以下のコードを加えてください：

source: Add the following just above the for-in loop’s closing curly brace (}).
ja: 以下をfor-inループの閉じ波確固（}）のすぐ上に加えてください。

source: Add the following line of code to dismiss the image picker:
ja: 以下のコード行を加えて、イメージピッカーを片付けてください：

source: Add the following method under the testMealInitializationSucceeds() method.
ja: 以下のメソッドをtestMealInitializationSucceeds()メソッドの下に加えてください。

source: Add these lines of code:
ja: これらのコード行を加えてください：

source: Add this code to create an image picker controller:
ja: このコードを加えることでイメージピッカーコントローラを作成してください：

source: Add this code to set the image picker controller’s delegate to ViewController:
ja: このコードを加えることでイメージピッカーコントローラの委任先をViewControllerに設定してください。

source: Add this code:
ja: このコードを加えます：

source: Add this line of code to set the selected image in the image view outlet that you created earlier:
ja: このコード行を加えて、選択された画像をあなたが以前に作成したイメージビューアウトレットの中に設定してください：

source: Add this line to call the superclass’s initializer.
ja: この行を加えてスーパークラスのイニシャライザを呼び出してください。

source: Add this line to call the superclass’s initializer:
ja: この行を加えてスーパークラスの持つイニシャライザを呼び出してください。

source: Add, move, and resize UI elements in a storyboard
ja: ストーリーボードの中でUI要素の追加、削除、そしてリサイズ（大きさ変更）をする

source: Adding an item, on the other hand, is a modal operation—the user performs an action that’s complete and self-contained, and then returns from that scene to the main navigation.
ja: ある項目を加えることは、別の面から言えば、モーダルな操作です—ユーザは完全で自己充足なひとつの動作を実行します、そしてそれからそのシーンから主要ナビゲーションに戻ります。

source: Additionally, now that Interface Builder has a live copy of your control, its layout engine can properly position and size the control.
ja: 加えて、Interface Builderがあなたのコントロールの本物のコピーを持つ今では、それのレイアウトエンジンは適切にコントロールの位置と大きさを決めます。

source: Additionally, when you click the Add button (+) and click Cancel instead of Save, the navigation should take you back to the meal list without adding a new meal.
ja: さらに加えて、あなたがAddボタン（+）をクリックしてCancelをSaveの代わりにクリックする場合、ナビゲーションは新しい食事を加えることなく、あなたを食事リストに戻らせます。

source: Adopt Auto Layout
ja: 自動レイアウトを採用する

source: After Meal, add a colon (:) and NSObject to subclass from the NSObject class:
ja: Mealの後で、コロン（:）とNSObjectを加えて、NSObjectクラスのサブクラスにしてください：

source: After NSObject, add a comma (,) and NSCoding to adopt the NSCoding protocol:
ja: NSObjectの後で、コンマ（,）とNSCodingを加えて、NSCodingプロトコルを採用してください：

source: After UIImagePickerControllerDelegate, add a comma (,) and UINavigationControllerDelegate to adopt the protocol.
ja: UIImagePickerControllerDelegateの後に、１つのコンマ（,）とUINavigationControllerDelegateを加えてください、それでこのプロトコルに準拠します。

source: After UITextFieldDelegate, add a comma (,) and UIImagePickerControllerDelegate to adopt the protocol.
ja: UITextFieldDelegateの後に、１つのコンマ（,）とUIImagePickerControllerDelegateを加えてください、それでこのプロトコルに準拠します。

source: After UIViewController, add a comma (,) and UITextFieldDelegate to adopt the protocol.
ja: UIViewControllerの後に、コンマ（,）とUITextFieldDelegateを加えてそのプロトコルに準拠してください。

source: After Xcode finishes building your project, the simulator starts automatically.
ja: Xcodeがあなたのプロジェクトをビルドし終えた後、シミュレータは自動的に始まります。

source: After an image picker controller is presented, you interact with it through the delegate methods.
ja: イメージピッカーコントローラが提供されてから後は、あなたはそれとデリゲートメソッドを通して相互作用します。

source: After creating the Meal objects, add them to the meals array using this code:
ja: いくらのMealオブジェクトの作成の後で、それらをmeals配列にこのコードを使って加えてください：

source: After determining the URL for the documents directory, you use this URL to create the URL for your apps data.
ja: 書類ディレクトリに対するURLを特定後、あなたはこのURLを使ってあなたのアプリのデータに対するURLを作成します。

source: After loading the images, create three meal objects.
ja: 画像をロード後、３つの食事オブジェクトを作成してください。

source: After logging the debug message, the method returns.
ja: デバッグメッセージを記録した後、メソッドは返ります。

source: After setting up the edit button (navigationItem.leftBarButtonItem = editButtonItem), add the following if statement:
ja: 編集ボタンを準備した後（navigationItem.leftBarButtonItem = editButtonItem）、if文の下に以下を加えてください：

source: After the guard statement, add the following code:
ja: guard文の後に、以下のコードを加えてください：

source: After the if statement, add an else clause and wrap it around the last four lines in the method.
ja: if文の後に、else節を加えて、それがこのメソッドの最後の４行の周りを包むようにしてください。

source: After the meals.removeAtIndex(indexPath.row) line, add the following line of code:
ja: meals.removeAtIndex(indexPath.row)行の後で、以下のコードを加える：

source: After the call to super.prepare(for:sender:), add this switch statement:
ja: super.prepare(for:sender:)への呼び出しの後に、このswitch文を加えてください：

source: After the if statement, add an else clause and move the call to loadSampleMeals() inside of it:
ja: if文の後で、else節を加えてloadSampleMeals()への呼び出しをそれの内側に移動してください：

source: After the line you just added, add the following if statement, and move the line that calls dismissViewControllerAnimated inside of it:
ja: あなたが加えだばかりの行の後で、以下のif文を加えてください、そしてdismissViewControllerAnimatedを呼び出している行をそれの内側に移動してください：

source: After you do that, the template implementation looks like this:
ja: あなたがこれをした後、ひな形実装はこのように見えます：

source: After you go through a lesson, you can download the project and check your work against it.
ja: あなたが１つのレッスンを潜り抜けた後、あなたはそのプロジェクトをダウンロードして、あなたの仕事をそれと照合することができます。

source: Again, Xcode adds the necessary code to ViewController.swift to store a reference to the label and configures the storyboard to set up that connection.
ja: 再び、Xcodeは必要なコードをViewController.swiftに加えることでラベルへの参照を保管します、そしてストーリーボードを修正することでこの接続を確立します。

source: Again, if your storyboard is set up correctly, the default case never executes.
ja: 再び、あなたのストーリーボードが正しく準備されるならば、defaultケース節は決して実行されません。

source: Again, the system automatically runs this test case when the unit tests are run.
ja: 再び、システムはユニットテストが実行される時に自動的にこのテスト項目を実行します。

source: Again, the text field, label, and button keep the same size and position relative to the screen’s upper left corner.
ja: 再び、テキスト欄、ラベル、そしてボタンは、同じ大きさと位置を画面の上左隅に関して保ちます。

source: All other views that you place in this scene will be subviews of this content view (although they themselves can have nested subviews).
ja: あなたがこのシーンの中に置いた他の全てのビューは、このコンテンツビューのサブビューになります（けれどもそれら自身が入れ子にされたサブビューを持つことができます）。

source: All test cases should pass.
ja: すべてのテスト項目がパスするはずです。

source: All the commands in this menu have two forms.
ja: このメニューのコマンド全ては、２つの形式を持ちます。

source: All view controller objects in iOS are of type UIViewController or one of its subclasses.
ja: iOSにおける全てのビューコントローラオブジェクトは、型UIViewControllerまたはそれのサブクラスの１つです。

source: All view objects in iOS are of type UIView or one of its subclasses.
ja: iOSでの全てのビューオブジェクトは、型UIViewまたはそれのサブクラスです。

source: Also notice that the status bar disappears in landscape orientation.
ja: また横方向ではステータスバーが見えなくなることに注意してください。

source: Also, Xcode lets you build, run, and debug your app—providing simulators for iOS devices and a powerful integrated debugger.
ja: また、Xcodeはあなたにあなたのアプリのビルド、実行、そしてデバッグを行わせます — iOSデバイスのためのシミュレータおよび強力なインタラクティブデバッガを提供します。

source: Also, for the purpose of this lesson, you assigned simple strings to the accessibility properties; however, a production app should use localized strings.
ja: また、このレッスンの目標として、あなたは単純な文字列をアクセシビリティプロパティに割り当てました；しかしながら、製品アプリはローカライズされた文字列を使うべきです。

source: Also, uncomment the implementation of tableView(_:canEditRowAt:) to support editing.
ja: また、tableView(_:canEditRowAt:)の実装のコメントを外して編集をサポートするようにしてください。

source: Alternatively, choose Product > Run (or press Command-R).
ja: または代わりに、Product > Runを選んでください（またはCommandキー + R）。

source: Alternatively, double-click the AppDelegate.swift file to open it in a separate window.
ja: あるいは、AppDelegate.swiftファイルをダブルクリックしてそれを独立したウインドウで開いてください。

source: Alternatively, swipe left on a cell to expose the Delete button quickly; this behavior is built into table views.
ja: その代わりに、あるセル上でスワイプして、Deleteボタンを素早く露出してください；この挙動は、テーブルビューに組み込まれます。

source: Alternatively, you can add your own code to the stub methods, defining custom behaviors that are executed when the methods are called.
ja: あるいは、あなたはあなた独自のコードをスタブメソッドに加えて、そのメソッドが呼び出される時に実行されるあつらえの挙動を定義することができます。

source: Alternatively, you can work through A Swift Tour from The Swift Programming Language (Swift 3.0.1).
ja: あるいはまた、あなたはA Swift Tourを通して勉強することがThe Swift Programming Language (Swift 3.0.1)から行えます。

source: Although it’s not written explicitly, this method is executed on an implicit self object.
ja: と言ってもそれは明示的には書かれません、このメソッドは暗黙的なselfオブジェクトで実行されます。

source: Although taking an app from a simple concept to the App Store isn’t a small task, the process and practices you’ve learned in this document will guide you in the right direction.
ja: あるアプリを単純な概念からApp Storeまでもっていくのは小さな作業ではありませんが、あなたがこの文書で学んだ手順と慣行はあなたを正しい方向へ導くでしょう。

source: Although the default description of built-in controls provides a good starting point, you may need to optimize the presentation of your user interface; especially for custom views and controls.
ja: 組み込みのコントロールの初期状態の解説は良い出発点を提供するとはいえ、あなたはあなたのユーザインターフェイスの表現を最適化する必要があるでしょう；とりわけカスタムビューおよびコントロールについて。

source: Although the project’s scene doesn’t do much yet, the basic user interface is there and functional.
ja: このプロジェクトのシーンはまだ多くのことをしていないとは言え、基本的なユーザインターフェイスはここにあって機能します。

source: Although the scene is connected to ViewController.swift, that’s not the only connection that needs to be made.
ja: このシーンはViewController.swiftに接続されると言っても、それはこの接続だけではなく作成されることを必要とします。

source: Although the template comes with the didReceiveMemoryWarning() method, you won’t need to implement it in these lessons, so go ahead and delete it.
ja: このひな形がdidReceiveMemoryWarning()メソッドを備えると言っても、あなたはこれらのレッスンにおいてそれを実装する必要はありません、それで前へ進みそれは削除してください。

source: Although this isn’t significant for the action you’re creating right now, it’s important to remember for later.
ja: これは今あなたが作成しているアクションにとって重大な意味を持ちませんが、それは重要なので後のために覚えておいてください。

source: Although you have the text field in your scene, there’s no instruction to the user about what to enter in the field.
ja: あなたはテキスト欄をあなたのシーンに持つにもかかわらず、ユーザに対してその欄に何を入力するかの指示がありません。

source: Although your data model code builds, you haven’t fully incorporated it into your app yet.
ja: あなたのデータモデルコードがビルドされたとは言え、あなたはまだそれをあなたのアプリに完全に組み入れてはいません。

source: An action (or an action method) is a piece of code that’s linked to an event that can occur in your app.
ja: あるアクション（またはアクションメソッド）は、あるコード断片です、それはあなたのアプリで発生可能なイベントと連結されます。

source: An initializer that could return nil after initialization.
ja: 初期化の後にnilを返すことが可能なイニシャライザ。

source: An instance of a class.
ja: あるクラスのひとつのインスタンス。

source: An object in your app (specifically, an instance of the AppDelegate class) that creates the window where your app’s content is drawn and that provides a place to respond to state transitions within the app.
ja: あなたのアプリの中のオブジェクトのひとつ（具体的には、AppDelegateクラスのインスタンス）、それはあなたのアプリのコンテンツ（内容）が描画されるところのウインドウを作成します、およびそれはそのアプリ内の状態の移り変わりに反応する部位を提供します。

source: An object in your app that’s responsible for managing the life cycle of the app, communicating with its delegate, the app delegate, during state transitions within the app.
ja: あなたのアプリのオブジェクトのひとつ、それは、アプリのライフサイクル管理に対して、それのデリゲート、アプリデリゲートとの通信に対して、アプリ内の状態の移り変わりの間を通して責任があります。

source: An object that acts on behalf of, or in coordination with, another object.
ja: あるオブジェクト、それは、別のオブジェクトに代わって、またはそれと連携して役割を果たします。

source: An object that is first to receive many kinds of app events, including key events, motion events, and action messages, among others.
ja: あるオブジェクト、それは、特にキーイベント、モーションイベント、そしてアクションイベントを含めた、多くの種類のアプリイベントを最初に受け取ります。

source: An object that manages a set of views and coordinates the flow of information between the app’s data model and the views that display that data.
ja: あるオブジェクト、それは、ひとそろいのビューを管理して、アプリのデータモデルとそのデータを表示するビューとの間の情報の流れを調整します。

source: An object that manages the app’s data model, providing a view object with the information it needs to display that data.
ja: あるオブジェクト、それはアプリのデータモデルを管理して、ビューオブジェクトをそれがそのデータを表示するのに必要とする情報とともに提供します。

source: An object that you attach to a view that allows the view to respond to actions the way a control does.
ja: あるオブジェクト、それは、あなたがビューに取り付けて、そのビューがコントロールが行うやり方でアクションに応答できるようにします。

source: An object that’s used to construct your user interface (UI) and display content to the user.
ja: あるオブジェクト、それは、あなたのユーザインターフェイス（UI）を組み立てるのに使われて中身（コンテンツ）をユーザに示します。

source: An optional that can also be used like a nonoptional value, without the need to unwrap the optional value each time it is accessed, because it’s assumed to always have a value after that value is initially set.
ja: あるオプショナル、それはまた、非オプショナル値のように、そのオプショナル値をそれがアクセスされるたびにアンラップする必要なしに使われることが可能なものです、なぜならそれがある値をその値が最初に設定された後に常に持つとみなされるからです。

source: An unwind segue moves backward through one or more segues to return the user to a scene managed by an existing view controller.
ja: 巻き戻しセグエは、後ろへと１つ以上のセグエを通り抜けて移動して、ユーザを既存のビューコントローラによって管理されるあるシーンに戻します。
